**Задание 1**
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
import pandas as pd
ratings = pd.read_csv('ratings.csv')

In [3]:
ratings[:5]

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [7]:
ratings.query('rating == {}'.format(5.0))['movieId'].value_counts().head(10)

318     153
296     123
356     116
2571    109
260     104
593      92
527      92
858      88
2959     81
1196     80
Name: movieId, dtype: int64

**Задание 2**
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [12]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [15]:
filtered_power = power.query('country == ["Latvia", "Lithuania", "Estonia"] & category == [4, 12, 21] & year >= 2005 & year <= 2010 & quantity > 0')
filtered_power

          country  year  quantity  category
10617     Estonia  2008       1.0         4
10620     Estonia  2005       1.0         4
11156   Lithuania  2008       1.0         4
11158   Lithuania  2006       1.0         4
11159   Lithuania  2005       1.0         4
...           ...   ...       ...       ...
253982  Lithuania  2009      98.0        21
253983  Lithuania  2008      54.0        21
253984  Lithuania  2007      47.0        21
253985  Lithuania  2006      31.0        21
253986  Lithuania  2005       1.0        21

[347 rows x 4 columns]

In [16]:
filtered_power.quantity.sum()

240580.0

**Задание 3**
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe. Примеры страниц (необязательно брать именно эти):
https://fortrader.org/quotes
https://www.finanz.ru/valyuty/v-realnom-vremeni

In [34]:
page_url = 'https://infotables.ru/meditsina/1198-koronavirus-v-rossii'
course = pd.read_html(page_url, attrs = {'class': 'tables90'}, encoding='utf-8')
course[0]

,0,1,2,3,4,5
0,№,Города России с корона­вирусом и субъ­екты РФ,Забо­левшие,Умер­ли,Выздо­ровели,На 1000
1,NaN,РОССИЯ (Всего),1326178 +13868,22966,1031785,90
2,1,Москва,339431 +4618,5687,264500,267
3,2,Московская область,78251 +420,1426,58967,102
4,3,Санкт-Петербург,48686 +557,3275,31909,90
...,...,...,...,...,...,...
82,81,Чеченская Республика,2503 +5,42,2039,17
83,82,Севастополь,1385 +30,41,886,31
84,83,Еврейская автономная область,1260 +29,19,779,80
85,84,Ненецкий автономный округ,356 +3,0,136,81
86,85,Чукотский автономный округ,212 +2,2,189,42

**Задание 4**
Напишите функцию, которая классифицирует фильмы из материалов занятия по следующим правилам:
- оценка 2 и меньше - низкий рейтинг
- оценка 4 и меньше - средний рейтинг
- оценка 4.5 и 5 - высокий рейтинг

Результат классификации запишите в столбец class

In [88]:
def func(rating):
    if rating <= 2:
        return 'низкий рейтинг'
    if rating < 4.5:
        return 'средний рейтинг'
    if rating >= 4.5 and rating <= 5:
        return 'высокий рейтинг'
    return 'Ошибка'

def cl():
    movies = pd.read_csv('movies.csv')
    classified = ratings.merge(movies, on=["movieId"], how='right').pivot_table(index=['title','movieId'], values = 'rating', aggfunc='mean')
    classified['class'] = classified['rating'].apply(func)
    print(classifiedRating.head(-10))
cl()

                                                   rating            class
title                                   movieId
'71 (2014)                              117867   4.000000  средний рейтинг
'Hellboy': The Seeds of Creation (2004) 97757    4.000000  средний рейтинг
'Round Midnight (1986)                  26564    3.500000  средний рейтинг
'Salem's Lot (2004)                     27751    5.000000  высокий рейтинг
'Til There Was You (1997)               779      4.000000  средний рейтинг
...                                                   ...              ...
Zoolander 2 (2016)                      148888   2.500000  средний рейтинг
Zoom (2006)                             47384    2.500000  средний рейтинг
Zoom (2015)                             156553   2.500000  средний рейтинг
Zootopia (2016)                         152081   3.890625  средний рейтинг
Zulu (1964)                             5899     4.000000  средний рейтинг

[9714 rows x 2 columns]

**Задание 5**
Используем файл keywords.csv.

Необходимо написать гео-классификатор, который каждой строке сможет выставить географическую принадлежность определенному 
региону. Т. е. если поисковый запрос содержит название города региона, то в столбце ‘region’ пишется название этого региона. 
Если поисковый запрос не содержит названия города, то ставим ‘undefined’.

Правила распределения по регионам Центр, Северо-Запад и Дальний Восток:

geo_data = {
'Центр': ['москва', 'тула', 'ярославль'],
'Северо-Запад': ['петербург', 'псков', 'мурманск'],
'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск']
}

Результат классификации запишите в отдельный столбец region.

In [95]:
keywords = pd.read_csv('keywords.csv')
geo_data = {'Центр': ['москва', 'тула', 'ярославль'], 
            'Северо-Запад': ['петербург', 'псков', 'мурманск'], 
            'Дальний Восток': ['владивосток', 'сахалин', 'хабаровск'] }

In [96]:
keywords.head()

         keyword     shows
0             вк  64292779
1  одноклассники  63810309
2          порно  41747114
3           ютуб  39995567
4      вконтакте  21014195

**Задание 6**
Есть мнение, что “раньше снимали настоящее кино, не то что сейчас”. Ваша задача проверить это утверждение, используя файлы 
с рейтингами фильмов из прошлого домашнего занятия (файл ratings.csv из базы https://grouplens.org/datasets/movielens). Т. е. проверить верно ли, что с ростом года выпуска фильма его средний рейтинг становится ниже.

При этом мы не будем затрагивать субьективные факторы выставления этих рейтингов, а пройдемся по следующему алгоритму:

В переменную years запишите список из всех годов с 1950 по 2010.

Напишите функцию production_year, которая каждой строке из названия фильма выставляет год выпуска. Не все названия фильмов содержат год выпуска в одинаковом формате, поэтому используйте следующий алгоритм:

для каждой строки пройдите по всем годам списка years
если номер года присутствует в названии фильма, то функция возвращает этот год как год выпуска
если ни один из номеров года списка years не встретился в названии фильма, то возвращается 1900 год
Запишите год выпуска фильма по алгоритму пункта 2 в новый столбец ‘year’

Посчитайте средний рейтинг всех фильмов для каждого значения столбца ‘year’ и отсортируйте результат по убыванию рейтинга